Final Year Project Master Files/Training Set Generation/TrainSet14G14U3_2D/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


type sets;
libs ("libsampling.so");

setFormat csv;

surfaceFormat raw;


interpolationScheme cellPoint;

fields
(
	p
	U
);

        
sets
(
	
	data
	{
	
		type        cloud;
		axis        xyz;
...
	}

	
);



// *********************************************************************** //
